/** @file

;******************************************************************************
;* Copyright (c) 2012, Insyde Software Corporation. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

//
// Copyright (c) 2004, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   BdsPlatformStrings.uni
//
// Abstract:
//
//   String definitions for BdsPlatform driver.
//
// Revision History:
//
// --*/

/=#

#include "Standard.uni"

#string STR_BOOT_FAILED_BY_SECURITY         #language en-US  " has been blocked by the current security policy."
                                            #language fr-FR  " has been blocked by the current security policy."
                                            #language zh-TW  " has been blocked by the current security policy."
                                            #language ja-JP  " has been blocked by the current security policy."
                                            #language it-IT  " has been blocked by the current security policy."
                                            #language es-ES  " has been blocked by the current security policy."
                                            #language de-DE  " has been blocked by the current security policy."
                                            #language pt-PT  " has been blocked by the current security policy."
#string STR_BOOT_FILE_FAILED_BY_SECURITY    #language en-US  "Execution of the selected file has been blocked by the current security policy."
                                            #language fr-FR  "Execution of the selected file has been blocked by the current security policy."
                                            #language zh-TW  "Execution of the selected file has been blocked by the current security policy."
                                            #language ja-JP  "Execution of the selected file has been blocked by the current security policy."
                                            #language it-IT  "Execution of the selected file has been blocked by the current security policy."
                                            #language es-ES  "Execution of the selected file has been blocked by the current security policy."
                                            #language de-DE  "Execution of the selected file has been blocked by the current security policy."
                                            #language pt-PT  "Execution of the selected file has been blocked by the current security policy."
#string STR_COMMON_BOOT_FAILED              #language en-US  " boot failed."
                                            #language fr-FR  " boot failed."
                                            #language zh-TW  " boot failed."
                                            #language ja-JP  " boot failed."
                                            #language it-IT  " boot failed."
                                            #language es-ES  " boot failed."
                                            #language de-DE  " boot failed."
                                            #language pt-PT  " boot failed."
#string STR_COMMON_BOOT_FILE_FAILED         #language en-US  "Execution of the selected file boot failed."
                                            #language fr-FR  "Execution of the selected file boot failed."
                                            #language zh-TW  "Execution of the selected file boot failed."
                                            #language ja-JP  "Execution of the selected file boot failed."
                                            #language it-IT  "Execution of the selected file boot failed."
                                            #language es-ES  "Execution of the selected file boot failed."
                                            #language de-DE  "Execution of the selected file boot failed."
                                            #language pt-PT  "Execution of the selected file boot failed."